app/Controllers/IntegrantesController.php

    public function cargarIntegrantes(){
        $integrante = new Integrantes();
        $resultado['resultado'] = $integrante->findAll();
---
SELECT *
FROM `integrantes`

    public function guardarIntegrantes(){
        $integrante_id = $this->request->getVar('txt_codigo');
        $nombre = $this->request->getVar('txt_nombre');
        $apellido = $this->request->getVar('txt_apellido');
        $fecha_nacimiento = $this->request->getVar('txt_fechaNac');
        $fecha_muerte = $this->request->getVar('txt_fechaMuerte');
        $web_oficial = $this->request->getVar('txt_webOficial');
        $pais_nacimiento = $this->request->getVar('txt_pais');

        $integrante = new Integrantes();
        $datos=['integrante_id'=>$integrante_id,
                'nombre'=>$nombre,
                'apellido'=>$apellido,
                'fecha_nacimiento'=>$fecha_nacimiento,
                'fecha_muerte'=>$fecha_muerte,
                'web_oficial'=>$web_oficial,
                'pais_nacimiento'=>$pais_nacimiento
        ];
        $integrante->insert($datos);
---
INSERT INTO `integrantes` (`integrante_id`, `nombre`, `apellido`, `fecha_nacimiento`, `fecha_muerte`, `web_oficial`, `pais_nacimiento`) VALUES ('2', 'Marilyn', 'Monrrou', '2024-08-06', '2024-09-06', 'www.marilyn.com.gt', 'Guatemala')

    public function localizarIntegrantes($integrante_id=null){
       $integrante = new Integrantes();
        $datosIntegrantes['datosIntegrantes']=$integrante->where('integrante_id',$integrante_id)->first();
---
SELECT *
FROM `integrantes`
WHERE `integrante_id` = '1'
 LIMIT 1